{"meta":{"slug":"raining-thoughts/why-i-prefer-anime","title":"Anime over others","description":"Why I preferred Anime over TV shows and movies.","tags":["raining-thoughts"],"publishedAt":1654178100000,"readingTime":3},"content":"<h1>Introduction</h1>\n<p>You might have wondered &quot;why do these people still watch cartoons?&quot;. Fun fact, anime isn't same as cartoon. There isn't technically a difference between them, both are animated. But theoretically, they vastly possess different meanings.</p>\n<h1>Cartoons vs. Anime</h1>\n<p>&quot;Cartoons are generally made to make people laugh and so are more comical.&quot;<sup>[1]</sup> Also, the fact that they primarily target children.</p>\n<p>So, what is anime and what does it specially illustrate? Anime <em>usually</em> expresses real-life situations which are made in a way that makes you actually feel it.</p>\n<h1>So, why do I like it?</h1>\n<h2>Quality</h2>\n<p>Like TV shows and movies, not all animes are good. But I can say that there are thousands of best ones. The way anime progresses brings you closer by which it makes you more and more relatable. Aspects like &quot;character development&quot; and &quot;plot&quot; are very well expressed in a way to keep you concentrated. Most of the anime involves a rollercoaster of emotions. The progression isn't just static and most of the time, you cannot even predict the very next thing. There are cliches but most of them are based on realistic situations.</p>\n<h2>Life lessons</h2>\n<p>Anime often carry out a life lesson. Those so called &quot;realistic situations&quot; teaches you a lot of things, to a point where they might even affect your personality. Though they are fictional, the feelings that are created inside you aren't fictional.</p>\n<h2>Artwork / Visuals</h2>\n<p>Creators put in a lot of effort into portraying everything. Attention to detail is something only you can see in anime, often times they even portray real locations. And &quot;artwork&quot; doesn't just mean the character (fan-service) you perverts.</p>\n<h2>Soundtrack</h2>\n<p>&quot;LESS DRAMA, LESS PERSONIFICATION and LESS LIES. The lyrics and music can easily intertwine with people's thought processes and reality.&quot;<sup>[2]</sup></p>\n<h2>Variety / Genres</h2>\n<p>Anime isn't a single entity. There are various genres like romance, comedy, slice of life, action, sci-fi, supernatural, psychological, mystery, horror, fantasy, etc.</p>\n<h1>Personal Recommendation</h1>\n<p>I don't watch anime for &quot;pleasing visuals&quot; (fan-service). I refuse wasting time on useless anime. Personally, I prefer slice of life, romance and comedy over other genres. Don't watch anime for the sake, you wouldn't actually understand it. So, if you really want to try out anime, I would recommend you to start from movies (min. of 1/2 hour) and then, expand into series (6+ hours). Some of the really good movies to start with are <a href=\"https://anilist.co/anime/20954/Koe-no-Katachi\">A Silent Voice</a> and <a href=\"https://anilist.co/anime/21519/Kimi-no-Na-wa/\">Your Name</a> after which I highly recommend you to watch <a href=\"https://anilist.co/anime/20665/Shigatsu-wa-Kimi-no-Uso/\">Your Lie in April</a>. If you do indeed decide to watch these, be prepared with your tissues. The deeper it gets, the harsh it is.</p>\n<h1>Conclusion</h1>\n<p>Unless you give it a try, you wouldn't know what it actually is about. &quot;Anime is immediately stereotyped as a 'childish' or 'immature' form of entertainment which is clearly not the case.&quot;<sup>[3]</sup> What you watch does also matter.</p>\n<h6>References</h6>\n<ul>\n<li><a href=\"https://www.diffen.com/difference/Anime_vs_Cartoon\">https://www.diffen.com/difference/Anime_vs_Cartoon</a><sup>[1]</sup></li>\n<li><a href=\"https://www.quora.com/Why-are-anime-songs-so-good\">https://www.quora.com/Why-are-anime-songs-so-good</a><sup>[2]</sup></li>\n<li><a href=\"https://www.quora.com/Why-are-so-many-people-reluctant-to-give-anime-a-try\">https://www.quora.com/Why-are-so-many-people-reluctant-to-give-anime-a-try</a><sup>[3]</sup></li>\n<li><a href=\"https://www.quora.com/Why-do-you-like-anime\">https://www.quora.com/Why-do-you-like-anime</a></li>\n</ul>"}